{
  "title": "The On-chain Indicators - by Ki Young Ju",
  "url": "https://cryptoquant.substack.com/p/the-on-chain-indicators-aee97e27cfd2",
  "date": "2020-04-08T11:19:16.781Z",
  "content": "In a traditional market, investors rely heavily on indicators when making financial decisions, since they tell us the strength and direction of the market. The same holds true for cryptocurrencies, and in this post, we will cover indicators for cryptocurrencies.\n\nMany of the indicators that are already available to us are developed for the traditional market. For example, one of the most widely used indicators,market cap, is found by liquefying shares outstanding to the current market price. With this, we can determine the size of a company.\n\nWhile the simple formula gives us useful information, they are inaccurate to be applied directly to cryptocurrencies. This is because unlike shares in the traditional market, coins can be unclaimed, lost or even become inert. As a result, new indicators started popping up for cryptocurrencies. Below, we will briefly introduce some of the widely used indicators for cryptocurrencies. It’s important to keep in mind that although they are designed specifically for them, even these approaches have limitations, which will be also be discussed later in the section, as well as our proposed solution to overcome those limitations.\n\nThe main objective of realized cap is to discount all lost or inert coins to find the actual market cap. There are two methods in calculating realized cap, UTXO coin, and account coin. UTXO coin assigns value to the output with the price at the time of its creation:\n\nΣ(UTXO volume of unspent coins * value at the time of creation)\n\nAddress coin is much trickier to handle since we have to deal with a list of addresses with balance rather than unspent coins. One method of address coin, called Virtual UTXO, keeps track of the current market price of every incoming movement. In outgoing movement, the coin with the smallest/largest amount is chosen for the transaction, and the new virtual UTXO from the transaction(change address) will be valued at the current market value. The realized cap is calculated by summing all virtual UTXOs multiplied by their recorded market value.\n\nΣ(coinbase rewards * price they were mined)\n\nThermo cap is obtained by summing all the rewards obtained from mining multiplied by the price they were mined. This represents the cumulative security spent by the network, and it’s assumed to be the actual inflow of coin. Thus, thermo cap tells us the ceiling of how much new capital has entered.\n\nNVT Ratio = network value / daily transaction volume\n\nNVT ratio indicates market confidence. Since investment activities determine daily transaction volume, increase in investment activities will increase daily transaction volume, which lowers NVT ratio, signaling a bear market. Likewise, a decrease in daily transaction volume would signal the bull market.\n\nBitcoin Network Momentum = Daily On-chain BTC Volume\n\nsource:http://charts.woobull.com/\n\nBitcoin network momentum is used to identify which stage the market cycle is in. This is found by observing the BTC price movement from daily on-chain BTC volume, like the plot above. The method is a no-brainer, but it serves as one of the leading indicators.\n\nNow that we have briefly introduced each indicator let’s discuss their limitations as a tool in making important financial decisions. The two main limitations of these indicators are the following:\n\nThe indicators are inflexible to observe setting other than what is made for, mainly due to the lack of data available to us.\n\nVolume used for these indicators is obtained by computing all transactions in the network. This is prone to noise.\n\nTo expand on data unavailability, realized cap’s definition of inert coins is not clear. Hence, it is essential that we have the right heuristics to identify inert coins in the market. As for thermo cap, the formula can only be used for identifying actual inflow of coins, since acquiring miner’s coinbase rewards data is a fairly easy task.\n\nAnother problem arises when we calculate the volume of the network. The issue with NVT ratio and bitcoin network momentum is that these metrics compute volume holistically; summing the entire transaction in the network. This is a critical flaw because the network itself is very noisy (e.g. dummy transactions, money laundry using tumbler, etc.), but these indicators account all of these movements, causing the indicator to overestimate the actual movement of bitcoin, making the indicator highly unreliable.\n\nTo obtain indicators that best describes the market, we need wallet information and the methodology to remove unnecessary transactions(noise) in the network. The question is just how do we do that? We believe the answer lies within deanonymization of cryptocurrencies.\n\nWith deanonymization technology, we can identify inert coins based on how we define them. We can create various indicators using different criteria for defining inert coins. Likewise, using the technology, we can find exchange wallet’s cap using the identified exchange wallet’s balance inflows and outflows.\n\nDerivations of indicators are also possible for NVT ratio and bitcoin network momentum. With the identified entity data, calculating the volume of each entity(e.g. Exchange NVT ratio using daily exchange transaction volume) is possible. This would greatly reduce the noise that is associated with other entities and empowers us to observe our target of interest from the overgeneralized network volume.\n\nTheoretically, we can also selectively remove all categorized entities such as miners and exchange services to find the remainder(individual wallets) and approximate the OTC market. This is how powerful having a collection of identified wallet data is, and why be believe cryptocurrency deanonymization is extremely crucial for indicators. More examples of indicators built from wallet data will be introduced in the following posts.\n\nWe have touched upon some of the most commonly used indicators for cryptocurrency. While these indicators can be of use, they lack to reflect the actual market accurately. Cryptocurrency deanonymization is crucial to overcome this problem. With categorized entity data obtained from deanonymization, we can create derived indicators to see the real market behind the noise.",
  "source": "cryptoquant"
}