{
  "title": "Entity Metrics to Directly Analyze Miners Position In Real Time",
  "url": "https://cryptoquant.substack.com/p/entity-metrics-to-directly-analyze",
  "date": "",
  "content": "On-chain metrics started with network metrics. This data, being publicly available, was fairly easy to access, and through it various signals have been found. One of the most notable pioneers in this space is the work of Willy Woo. With the halving approaching, and price recently dropping, a lot of attention is being placed on miners. Historically, network data has provided a consistent indicator for miners and capitulation.\n\nThe standard for miners and on-chain data is Willy Woo's Bitcoin Difficulty Ribbon that shows when miners are capitulating as an indicator of bottoms. It indicated that in this bear cycle, the three\"bottoms\" were around the 3k area in January to February of 2019, November to January of 2020, and recently with the last drop as miners have already turned over. By looking at entity data from miners (inflow and outflows), we can find new data and indicators that will supports to the Bitcoin Difficulty Ribbon.\n\nLooking at the data, Miners to Exchange Inflow Percentage gives us a similar signal. This is calculated by taking Miner to Exchange Flows and dividing it by Exchange Inflows. We can see that when miners are composing over 6% of inflows into exchanges, its a signal that miners are liquidating their BTC. A quite interesting piece of data is that just as Willys Difficulty ribbons flip twice, we also see two large Miner flows to exchanges in both the beginning of 2019 bottom and the end of 2019 bottom. The one exception to this is the large liquidation that happened on August second, but this, being in a mini bull market, can be interpreted as sell signal.\n\nIt seems that, in this case, network data and entity data can be complimentary signals. This confluence will help traders be more confident in timing their entries and exits. In the coming weeks, we will continue to publish insights to find additional ways that entity data can strengthen network data, and vice-versa.\n\nCheck out our metrics in real time: https://www.cq.live/overview\n\nCoinTelegraph Article Featuring This Data: https://cointelegraph.com/news/bitcoin-price-will-go-up-as-only-profitable-miners-remain-data-analyst",
  "source": "cryptoquant"
}