{
  "title": "Bitcoin Volatility Incoming - Rekt Capital Newsletter",
  "url": "https://rektcapital.substack.com/p/bitcoin-volatility-incoming-f20",
  "date": "",
  "content": "Welcome to the Rekt Capital newsletter, a place for people who want to better navigate the crypto markets with the help of cutting-edge crypto research and unbiased market analysis.\n\nGive a gift subscription\n\nBitcoin has rejected from the Monthly Range high of $28900 and has been dropping within this $23400-$28900 macro range ever since.\n\nOf course, some reaction within the range is occurring with a downside wick developing here; interestingly enough, this reaction is occurring at around the mid-point of the range.\n\nEvery range has a mid-point and it dictates whether price continues to maintain the upper half of the range or the lower part of the range:\n\nAt the moment, this mid-point (black) is holding as support and this is where the reaction is occurring.\n\nAs long as price maintains above this mid-range, then price will continue to occupy the upper half of the range.\n\nLose this level as support and price would occupy the lower half of the range.\n\nWill BTC stay above the mid-range or will it lose it?\n\nIn Bull Markets, the green 21-week EMA and blue 50-week EMAs act as bullish momentum indicators.\n\nWhen they act as support and continues to act as support over time, they facilitate uptrends.\n\nAnd interestingly enough, both Bull Market EMAs are serving as support here, propping price up.\n\nThis is a good sign because bullish EMAs holding up price tend to precede uptrending price action.\n\nThe problem however is that BTC is also forming a series of Lower Highs (blue) which have been developing since mid-April.\n\nClearly, BTC is now compressing in its price into the apex of what is becoming a triangle; the base of the triangle being the bullish EMAs and the diagonal resistance of the pattern being the Lower Highs.\n\nBulls will say there is a downtrending channel forming here (or a Falling Wedge) and bears will say there is a descending triangle forming here.\n\nBut the key here is to move away from labels and focus on what needs to occur for a confirmed trend to occur.\n\nIt’s clear that losing the bullish EMAs would be bearish and so a Weekly Close below the two EMAs would likely precede downside.\n\nOn the flip side of that, it is clear that a Weekly Close beyond the Lower Highs would end the multi-month downtrend and precede a bout of upside.\n\nWith this price compression, time is running out on this period of volatility as price compression precedes a strong breakout move; with the apex being close, an increase volatility in the market is looming large.",
  "source": "rektcapital"
}