{
  "title": "Iran and Market Behavior: A Deep Dive with On-Chain",
  "url": "https://cryptoquant.substack.com/p/iran-and-market-behavior-a-deep-dive-with-on-chain-79418eb988f6",
  "date": "",
  "content": "With the recent Iran Crisis, the price of Bitcoin rose in tandem with that of gold and oil, assets that are traditionally known as safe-havens/hedges against uncertainty. Following the event, many people have been asking if this proves the narrative that Bitcoin is becoming a hedge against risk. Although statistical correlation is still a ways away, we use on-chain data to observe the behavior of traders, and to see if those wanting to hodl increased during this period.\n\nFor Bitcoin, was the recent movement in price just price action based on speculators, or were more people attempting to hold the asset, generating the demand? Simply looking at volume cannot differentiate between these two types of investors. Instead something else is needed.. Exchange outflows allow us to see the people who bought bitcoins and are intending to hold it for more than just a short period of time.\n\nHistorically, during periods when exchange outflow is high, the price typically forms a bottom as over time supply (on exchanges) dries up and demand drives price upward. As soon as the price dropped below 4k in November of 2018, we see exchange outflows increased significantly. This stayed true until May of 2019, when the mini-bull run began and price eventually topped just under 14k.\n\nOn shorter time frames, we can also see that individual large outflows have a strong tendency to indicate that the price is bottoming and/or continuing the move upward.\n\nFor this research, we have removed derivative exchange outflows. This is because Bitcoin is used to both long and short on derivative exchanges, as well as the nature of derivatives being more speculative than spot.\n\nThere are two frames from which to view the Iranian Crisis. The first is the crisis as a whole event, taking place over multiple days, and the second is analyzing specific points that lead to escalations. (The death of Soleimani/Iran executed missile attacks on U.S. military positions) Looking at both of these will allows provide insight into\n\nIf Bitcoin is being perceived by some as a safe-haven asset?\n\n2. If they do, how fast/intensely did investors react?\n\nThe crisis began on January 2nd, reached a peak on January 7th, and ended with Trump’s announcement on January 8th. Prior to the crisis, we can see that outflows hit a nearly 2 month low, at 12.17k for January 1st. Following the U.S. strikes, outflow rose to 37.24k on January 3rd. They fell back to 18.15k on the 5th, before rising again to peak at 49.14k on January 8th, the day following the Iranian strikes against the U.S military. This was the highest outflow that had occurred since November 29th of 2019. Bitcoin outflows increased by 4x over the course of the crisis. This narrative is further strengthened when we see that these increases in outflows correlated highly with the bottom in price on January 2nd.\n\nU.S. airstrikes near the Baghdad Airport took place at 22:00 on January 2nd. News of the event began actively circulating within 12 hours, with the most notable, a tweet from an Iranian official, taking place at January 3rd, 3:58 am UTC. During this time we can see an active rise in exchange outflows, with price also rising accordingly. On block 611,036, which took place at UTCH 2020–01–03 04:16:03, outflows rise from 5 BTC in the previous block to 648 BTC. These high outflows continue to occur, and lead to a peak at block 611,042. Here there was 780 BTC withdrawn, and it was also during this block that price jumped from 7016 to 7238.\n\nIranian strikes against the U.S. took place at approximately 22:30 on January 7th. News of these attacks began coming out within 4 hours after. We see a similar pattern here as previous. Block 611,801 was mined at UTC 22:34. The exchange outflow was 642.53 BTC. This outflow occurred at the exact local bottom of $8,000. It could be suggested that someone knew about the attacks, and began withdrawing immediately. Following this, outflows were relatively low for a little over an hour, then saw a sustained increase, which peaked at block 611,817. The outflow here was 820.09 BTC, and this was the same block that saw price increase sharply, from 8,160 to 8,304 (1.7%) in the twenty minute period between the two blocks.\n\nThe “conflict” formally concluded with Trump announcing that the United States wouldn’t pursue further engagements. This took place around January 8th, 14:00 UTC. Block 611,918 was mined at 16:50 UTC. This block was the last large outflow we see, and since then, outflows have again decreased, with no outflow since then reaching over 800. This against correlates with the price drop, and in part explains the subsequent difficulty price has had to get above of 8.2k.\n\nLooking at both a macro and micro scale, through the events of the US-Iran conflict, we can see how each step affected peoples desire to hodl Bitcoin. Although we can’t determine exactly what number of people wanted to hodl, there seems to be a clear change in on-chain behavior as the conflict took place. As tensions rose, we see peoples desire to hold the asset increased. But as soon as the conflict was resolved, this demand dropped, leading to a downturn in price. In all cases, the reaction was within a few hours, and it did seem that some people had firsthand information, with larger exchange outflows taking place within the same or next block.\n\nAlthough a one time event is never enough to be conclusive, it does provide an interesting overview of what could be a continuing shift in the perception of Bitcoin. Although Bitcoin is, and for the foreseeable future, will remain a speculative asset, through on-chain data, we can see firsthand what kind of behavior drives influences price, and better understand that behavior.\n\nNote: Total Spot Exchange to BitMEX outflow for this period was less than 3% of the total spot outflow.",
  "source": "cryptoquant"
}