{
  "title": "Q. Was the crash caused by the Sudden Hash rate Decrease?",
  "url": "https://cryptoquant.substack.com/p/q-was-the-crash-caused-by-the-sudden-hash-rate-decrease-56d9c9d46ae0",
  "date": "",
  "content": "Following our report yesterday on the BitMEX Withdrawal system as a core cause of the crash, we look into the validity of claims that hashrate is what caused the sudden drop in price.\n\nData Source: CryptoQuant\n\nMany sources are claiming that the hashrate fall is the source of the drop in price. But hash rate acts as a lagging indicator following Bitcoin price. Its role as a factor in price is minimal. Looking at the hashrate chart overlaid onto the price chart, it is difficult to establish a correlation between the two.\n\nTo investigate the idea of little to no correlation, we conducted analysis into the correlation between the price and hashrate. Correlation was measured by comparing the price and the average hash rate over 1 day and 10 day periods.\n\nCorrelation of 1 Day Hashrate and BTC Price\n\nData Source: CryptoQuant\n\nCorrelation of 10 Day Hashrate and BTC Price\n\nData Source: CryptoQuant\n\nOur analysis found that the price of BTC and the hashrate at both 1 day and 10 day averages have no correlation, as thecoefficientdoesn’t exceed -0.2 ~ 0.2. The recent decline was also the case, as miners didn’t impact price. The decline in hashrate was instead a result of miners decreased profitability.\n\nMoving forward, the value of On-Chain data will only increase, as on-chain data’s role in analysis grows. It is difficult to build a comprehensive understanding of the Bitcoin ecosystem and the exchanges, miners, dark net and whales that it consists of without this data. Their holdings and movement of coins proves to be central to building this understanding. Here at CryptoQuant, we intend on continually producing specialized data for hedge funds and institutional investors, as well as reports outlining our views of the Bitcoin ecosystem.",
  "source": "cryptoquant"
}